#include <iostream>
#include <stdlib.h>
#include <windows.h>
#include <stdio.h>
#include <conio.h>
#include <locale.h>
#include <math.h>
using namespace std;
int main()
{
	HANDLE Hconsole;
	Hconsole = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(Hconsole, 9);


	setlocale(LC_ALL, "Rus");
	int nz;
	cout << "Ведиет номер задания ";
	cin >> nz;

	switch (nz)
	{
		//1.	Пользователь вводит два числа.
		//	Определить, равны ли эти числа, и если нет, вывести их на экран в порядке возрастания

	case 1:
	{
		int a, b;
		cout << "Ведите первое число";
		cin >> a;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите второе число";
		cin >> b;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Сейчас идет вы увидите равны ли эти числа если они не равны они выйведутся на экран в порядке возрастания"<<endl;
		cout << "_______________________________________________________________________________________________________" << endl;
		if (a==b)
		{
			cout << "Числа равны друг другу a=b" << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		else if(a>=b)
		{
			cout << b << a << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		else if (a<=b)
		{
			cout << a << b << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		break;
	}


	//2.	Пользователь с клавиатуры вводит 5 оценок студента.
	//	Определить, допущен ли студент к экзамену.Студент получает допуск, если его средний балл 4 балла и выше
	case 2:
	{
		int a, b,c,d,f;
		int res;
		cout << "Ведите первую оценку";
		cin >> a;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите вторую оценку";
		cin >> b;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите третью оценку";
		cin >> c;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите четвертую оценку";
		cin >> d;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите пятую оценку";
		cin >> f;
		cout << "_______________________________________________________________________________________________________" << endl;
		res = (a + b + c + d + f) / 5;
		if (res >= 4)
		{
			cout << "Студент допущен к экзамену" << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		else if(res<=4)
		{
			cout << "Студент не допущен к экзамену" << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		break;
	}



	/*3.	Пользователь с клавиатуры вводит 5 оценок студента.
		Определить, допущен ли студент к экзамену.Студент получает 
		допуск, если его средний балл 4 балла и выше*/

	case 3:
	{
		int a, b, c, d, f;
		int res;
		cout << "Ведите первую оценку";
		cin >> a;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите вторую оценку";
		cin >> b;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите третью оценку";
		cin >> c;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите четвертую оценку";
		cin >> d;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите пятую оценку";
		cin >> f;
		cout << "_______________________________________________________________________________________________________" << endl;
		res = (a + b + c + d + f) / 5;
		if (res >= 4)
		{
			cout << "Студент допущен к экзамену" << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		else if (res <= 4)
		{
			cout << "Студент не допущен к экзамену" << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		break;


	}

	//4.	Написать программу - калькулятор.
	//	Пользователь вводит два числа и выбирает арифметическое действие.Вывести на экран результат
	case 4:
	{
		int a, b,d;
		char c;
		cout << "Ведите первое число  и нажмите Enter  ";
		cin >> a;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите знак: Плюс'+' , Минус '-' , Умножить'*', Делить '/'  Нажмите Enter " << endl;
		cin >> c;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите второе число и нажмите Enter  ";
		cin >> b;
	    cout << "_______________________________________________________________________________________________________" << endl; 
		switch (c)
		{
		case '+': d = a + b;
			cout << "_______________________________________________________________________________________________________" << endl;
			break;
		case '-': d = a - b;
			cout << "_______________________________________________________________________________________________________" << endl;
			break;
		case '*': d = a * b;
			cout << "_______________________________________________________________________________________________________" << endl;
			break;
		case '/': d = a / b;
			cout << "_______________________________________________________________________________________________________" << endl;
			break;
		}
		cout << "Результат = " << d<<endl;
		cout << "_______________________________________________________________________________________________________" << endl;
			break;
		}
	

	//1.	Написать программу, которая 
	//	по выбору пользователя меняет цвет консольного приложения.Пользователь
	//	может выбрать цвет шрифта и цвет фона
	case 5:
	{
		char text, fon;
		cout << "0 = Черный\t8 = Серый\n";
		cout << "1 = Синий\t9 = Светло - синий\n";
		cout << "2 = Зеленый\tA = Светло - зеленый\n";
		cout << "3 = Голубой\tB = Светло - голубой\n";
		cout << "4 = Красный\tC = Светло - красный\n";
		cout << "5 = Лиловый\tD = Светло - лиловый\n";
		cout << "6 = Желтый\tE = Светло - желтый\n";
		cout << "7 = Белый\tF = Ярко - белый\n\n";
		cout << "Введите цвет фона: ";
		cin >> fon;
		cout << "Введите цвет текста: ";
		cin >> text;
		switch (fon == text) {
		case true: {cout << "Невозможно поменять цвета."; }
		case false: {
			switch (fon) {
			case '0': {
				switch (text) {
				case '1': {system("color 01"); break; }
				case '2': {system("color 02"); break; }
				case '3': {system("color 03"); break; }
				case '4': {system("color 04"); break; }
				case '5': {system("color 05"); break; }
				case '6': {system("color 06"); break; }
				case '7': {system("color 07"); break; }
				case '8': {system("color 08"); break; }
				case '9': {system("color 09"); break; }
				case 'a': {}
				case 'A': {system("color 0A"); break; }
				case 'b': {}
				case 'B': {system("color 0B"); break; }
				case 'c': {}
				case 'C': {system("color 0C"); break; }
				case 'd': {}
				case 'D': {system("color 0D"); break; }
				case 'e': {}
				case 'E': {system("color 0E"); break; }
				case 'f': {}
				case 'F': {system("color 0F"); break; }
				}break;
				switch (fon == text) {
				case true: {cout << "Невозможно поменять цвета."; }
				case false: {
					switch (fon) {
					case '1': {
						switch (text) {
						case '1': {system("color 12"); break; }
						}break;
					}
					}break;
				}
				}break;

			}
			}

			cin.get(); cin.get();
		}
		}
	}


	//6.	Написать программу, которая по выбору пользователя возводит введенное
	//	им число в степень от нулевой до седьмой включительно
	case 6:
	{
		
		int a,b;
		cout << "Ведите число  ";
		cin >> a;
		cout << "_______________________________________________________________________________________________________" << endl;
		b = a*a;
		if (a > 0 && a<7)
		{
			cout << "Число в квадрате равняется  " << b << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		break;
	}

	//7.	В час пик на остановку одновременно подъехали три маршрутных такси, следующие по одному маршруту, 
	//	в которые тут же набились пассажиры.Водители обнаружили, что количество людей в разных маршрутках разное, 
	//	и решили пересадить часть пассажиров так, чтобы в каждой маршрутке было поровну пассажиров.Требуется по количествам
	//	людей в трех маршрутках 
	//	определить, какое наименьшее количество пассажиров придаться при этом пересадить(если это вообще возможно)
	case 7:
	{
		int a, b, c, d, x;
		cout << "Ведите первое число людей которые сели на маршрутку  ";
		cin >> a;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите второе число людей которые сели на вторую маршрутку  ";
		cin >> b;
		cout << "_______________________________________________________________________________________________________" << endl;
		cout << "Ведите третье  число число людей которые сели на третью маршрутку ";
		cin >> c;
		cout << "_______________________________________________________________________________________________________" << endl;
		if  ((d = (a + b + c) / 3) && (a - d>b - d) && (x = a - d) && (x = b - d) && (c - d>x) && (x = c - d))
		{
			cout << " Возможно" << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
		}
		else if ((a + b + c) / 3 != 0)
		{
			cout << "Невозможно " << endl;
			cout << "_______________________________________________________________________________________________________" << endl;
			
		}
	}




	default:
	{
		cout << "Такого задания нету повторите запрос" << endl;
	}
	break;
	}


	system("pause");
	//getch();
}